src_ext/Documents/УЗ_РасходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_РасходДенег</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Document.УЗ_РасчетЗарплаты</xr:Item>
				<xr:Item>Catalog.УЗ_Абонемент</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасчетЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_РасходДенег/Ext/ManagerModule.bsl
// Печать — точка входа подменю «Печать» (сигнатура БСП; вызывают форма печати хозяина
// и своя печать УЗ_Печать.СформироватьСвоейПечатью). Идентификатор формы — "РКО".
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УЗ_Печать.НужноПечататьМакет(КоллекцияПечатныхФорм, "РКО") Тогда
		УЗ_Печать.ВывестиВКоллекцию(КоллекцияПечатныхФорм, "РКО", НСтр("ru = 'Расходный кассовый ордер'"),
			ПечатьРКО(МассивОбъектов, ОбъектыПечати));
		УЗ_Печать.УстановитьЗаголовок(ПараметрыВывода, НСтр("ru = 'Расходный кассовый ордер'"));
	КонецЕсли;

КонецПроцедуры

// Расходный кассовый ордер (унифицированная форма КО-2), каждый документ на своей странице.
// Макет строит tools\макеты\макет_рко.py. Счета и коды, данные руководителя, главного
// бухгалтера и документа получателя — пустые графы для ручного заполнения: в «Учёте занятий»
// их нет, а выдумывать нельзя.
Функция ПечатьРКО(МассивОбъектов, ОбъектыПечати) Экспорт

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УЗ_РасходДенег_РКО";
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Макет = Документы.УЗ_РасходДенег.ПолучитьМакет("ПечатьРКО");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РКО.Ссылка КАК Ссылка,
	|	РКО.Номер КАК Номер,
	|	РКО.Дата КАК Дата,
	|	РКО.Организация КАК Организация,
	|	РКО.Подразделение КАК Подразделение,
	|	РКО.ФизЛицо КАК ФизЛицо,
	|	РКО.СуммаДокумента КАК СуммаДокумента,
	|	РКО.НазначениеПлатежа КАК НазначениеПлатежа,
	|	РКО.АвторДокумента КАК АвторДокумента
	|ИЗ
	|	Документ.УЗ_РасходДенег КАК РКО
	|ГДЕ
	|	РКО.Ссылка В (&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РКО.Дата,
	|	РКО.Ссылка";
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		//область берём заново на каждый документ: параметры прошлого документа не переживут
		Шапка = Макет.ПолучитьОбласть("Шапка");
		Организация = УЗ_Печать.СведенияОбОрганизации(Выборка.Организация);
		СуммаПрописью = ЧислоПрописью(Выборка.СуммаДокумента, ,
			НСтр("ru = 'рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2'"));

		Шапка.Параметры.ПредставлениеОрганизации = Организация.Представление;
		Шапка.Параметры.ОрганизацияПоОКПО = Организация.ОКПО;
		Шапка.Параметры.ПредставлениеПодразделения = Строка(Выборка.Подразделение);
		Шапка.Параметры.НомерДокумента = УЗ_ОбщийКлиентСервер.НомерНаПечать(Выборка.Номер);
		Шапка.Параметры.ДатаДокумента = Формат(Выборка.Дата, "ДЛФ=D");
		Шапка.Параметры.Сумма = Формат(Выборка.СуммаДокумента, "ЧЦ=15; ЧДЦ=2");
		Шапка.Параметры.Выдать = Строка(Выборка.ФизЛицо);
		Шапка.Параметры.Основание = Выборка.НазначениеПлатежа;
		Шапка.Параметры.СуммаПрописью = СуммаПрописью;
		Шапка.Параметры.ФИОКассира = Строка(Выборка.АвторДокумента);
		//графы, которых в «Учёте занятий» нет (см. комментарий к функции)
		Шапка.Параметры.КодПодразделения = "";
		Шапка.Параметры.КорСчет = "";
		Шапка.Параметры.КодАналитическогоУчета = "";
		Шапка.Параметры.КодКредита = "";
		Шапка.Параметры.КодЦелевогоНазначения = "";
		Шапка.Параметры.Приложение = "";
		Шапка.Параметры.ФИОРуководителя = "";
		Шапка.Параметры.ФИОГлавногоБухгалтера = "";
		Шапка.Параметры.ПоДокументу = "";

		ТабличныйДокумент.Вывести(Шапка);
		УЗ_Печать.ЗадатьОбластьДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);

	КонецЦикла;

	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	Возврат ТабличныйДокумент;

КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Номер = Данные.Номер;
	Пока Лев(Номер, 1) = "0" Цикл
		Номер = Прав(Номер, СтрДлина(Номер) - 1);
	КонецЦикла;

	Представление = "РКО (расход-) " +Номер+ " от " +Формат(Данные.Дата,"ДФ='д.ММ.гг (ддд)'")+ " "
	+Данные.Ссылка.ФизЛицо;

КонецПроцедуры
